marcelinoandrade/ExpertOnDevice-AI/firmware/esp32_p4_firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# CONFIG_APP_MINIMAL_HOSTED_LINK_TEST is not set
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=131072
CONFIG_ESP_VIDEO_BUFFER_POOL_SIZE=2
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BSP_CONTROL_C6_EN_PIN=n
CONFIG_BSP_DISPLAY_LVGL_MAX_SLEEP=20
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=20000
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=27
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=28
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=29
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=30
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=9
CONFIG_ESP_HOSTED_SDIO_RESET_DELAY_MS=2000
CONFIG_ESP_HOSTED_SDIO_PIN_D2=31
CONFIG_ESP_HOSTED_SDIO_PIN_D3=32
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=27
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=28
CONFIG_ESP_HOSTED_SDIO_PIN_D0=29
CONFIG_ESP_HOSTED_SDIO_PIN_D1=30
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=31
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=32
CONFIG_CAMERA_OV2710=y
CONFIG_CAMERA_OV2710_AUTO_DETECT=y
CONFIG_CAMERA_OV2710_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV2710_MIPI_RAW10_1920X1080_25FPS=y
CONFIG_CAMERA_OV2710_MIPI_IF_FORMAT_INDEX_DAFAULT=0
CONFIG_CAMERA_OV2710_STATS_UPDATE_EN=y
CONFIG_CAMERA_OV2710_STATS_UPDATE_INTERVAL=120
CONFIG_ESP_IPA_IAN_ALGORITHM=y
CONFIG_ESP_IPA_ADN_ALGORITHM=y
CONFIG_ESP_IPA_AWB_ALGORITHM=y
CONFIG_ESP_IPA_ACC_ALGORITHM=y
CONFIG_ESP_IPA_AGC_ALGORITHM=y
CONFIG_ESP_IPA_AEN_ALGORITHM=y
CONFIG_ESP_IPA_ATC_ALGORITHM=y
CONFIG_ESP_VIDEO_ENABLE_ISP=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_VIDEO_DEVICE=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_UNSCII_8=y
CONFIG_LV_FONT_UNSCII_16=y
# mbedTLS: usa buffers dinamicos e libera certificados apos verificacao
# para reduzir pressao na DRAM interna durante handshake TLS/HTTPS
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# WDT: aumenta timeout da task LVGL para tolerar picos de processamento
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# LWIP & VFS Limits (Crucial after early boot race-condition)
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_VFS_MAX_COUNT=15

# Enable FATFS Long File Names (prevent ENOENT for IMG_YYYYMMDD_HHMMSS.jpg)
CONFIG_FATFS_LFN_HEAP=y
